src/Documents/РасходноКассовыйОрдер/РасходноКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
	<name>РасходноКассовыйОрдер</name>
	<registerRecords>AccumulationRegister.ВзаиморасчетыСКассирами</registerRecords>
	<registerRecords>AccumulationRegister.ВзаиморасчетыСАгенствами</registerRecords>
	<registerRecords>AccumulationRegister.ДвижениеДенежныхСредств</registerRecords>
	<attributes>
		<name>Операция</name>
		<type>
			<types>EnumRef.ХозОперации</types>
		</type>
	</attributes>
	<attributes>
		<name>Поставщик</name>
		<type>
			<types>CatalogRef.Агенство</types>
		</type>
	</attributes>
	<attributes>
		<name>Касса</name>
		<type>
			<types>CatalogRef.Касса</types>
		</type>
	</attributes>
	<attributes>
		<name>БанковскийСчет</name>
		<type>
			<types>CatalogRef.БанковскийСчет</types>
		</type>
	</attributes>
	<attributes>
		<name>СуммаОплаты</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>Валюта</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</attributes>
	<attributes>
		<name>ВидОплаты</name>
		<type>
			<types>EnumRef.ВидОплаты</types>
		</type>
	</attributes>
	<attributes>
		<name>ПроцентАГН</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>ПроцентСуб</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>НужнаКонвертация</name>
		<type>
			<types>Boolean</types>
		</type>
	</attributes>
	<attributes>
		<name>КассаКонвертации</name>
		<type>
			<types>CatalogRef.Касса</types>
			<types>CatalogRef.БанковскийСчет</types>
		</type>
	</attributes>
	<attributes>
		<name>Курс</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>3</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>СуммаКонвертации</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>ВалютаКонвертации</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</attributes>
</mdclass:Document>

src/AccumulationRegisters/ВзаиморасчетыСАгенствами/ВзаиморасчетыСАгенствами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
	<name>ВзаиморасчетыСАгенствами</name>
	<resources>
		<name>СуммаЗадолженностиАГН</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>10</precision>
			</numberQualifiers>
		</type>
	</resources>
	<attributes>
		<name>ВидОперации</name>
		<type>
			<types>EnumRef.ХозОперации</types>
		</type>
	</attributes>
	<dimensions>
		<name>Авиакомпания</name>
		<type>
			<types>CatalogRef.Агенство</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Билет</name>
		<type>
			<types>CatalogRef.Билет</types>
		</type>
	</dimensions>
	<dimensions>
		<name>ВалютаВзаиморасчетов</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидОплаты/ВидОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>ВидОплаты</name>
	<enumValues>
		<name>Наличный</name>
	</enumValues>
	<enumValues>
		<name>Безналичный</name>
	</enumValues>
</mdclass:Enum>

src/Documents/РасходноКассовыйОрдер/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЭтаФорма.Параметры.ВидОперации="ОплатаПоставщику" Тогда
		ЭтаФорма.Заголовок="Оплата поставщику";	
	ИначеЕсли ЭтаФорма.Параметры.ВидОперации="ПрочийРасход" Тогда
		ЭтаФорма.Заголовок="Прочий расход денежных средств";
		Элементы.Группа2.Видимость=Ложь;
	КонецЕсли;
	Если Объект.НужнаКонвертация Тогда
		Элементы.СуммаКонвертации.Видимость=Истина;
		Элементы.ВалютаКонвертации.Видимость=Истина;
		Элементы.Курс.Видимость=Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОплатыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Данные=ОбработкаВыбора(ВыбранноеЗначение);
	Если Данные="Наличный" Тогда
		Элементы.БанковскийСчет.Видимость=Ложь;
		Элементы.Касса.Видимость=Истина;
	ИначеЕсли Данные="Безналичный" Тогда
		Элементы.БанковскийСчет.Видимость=Истина;
		Элементы.Касса.Видимость=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОбработкаВыбора(ВыбранноеЗначение)
	ВидОплаты="";
	Если ВыбранноеЗначение=Перечисления.ВидОплаты.Наличный Тогда
		ВидОплаты="Наличный";	
	ИначеЕсли ВыбранноеЗначение=Перечисления.ВидОплаты.Безналичный Тогда
		ВидОплаты="Безналичный";	
	КонецЕсли;
	Возврат ВидОплаты;
КонецФункции

&НаСервереБезКонтекста
Функция ПоставщикОбработкаВыбораНаСервере(ВыбранноеЗначение)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыСАвиакомпаниямиОстатки.СуммаЗадолженностиАГНОстаток КАК СуммаЗадолженностиАГНОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСАгенствами.Остатки КАК ВзаиморасчетыСАвиакомпаниямиОстатки
	|ГДЕ
	|	ВзаиморасчетыСАвиакомпаниямиОстатки.Авиакомпания = &Авиакомпания";
	
	Запрос.УстановитьПараметр("Авиакомпания", ВыбранноеЗначение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Долг=0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Долг=ВыборкаДетальныеЗаписи.СуммаЗадолженностиАГНОстаток;	
	КонецЦикла;
	Возврат Долг;
	
КонецФункции
&НаКлиенте
Процедура ПоставщикОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Долг=ПоставщикОбработкаВыбораНаСервере(ВыбранноеЗначение);
	Элементы.Декорация1.Заголовок="Долг: "+Долг;
КонецПроцедуры

&НаКлиенте
Процедура НужнаКонвертацияПриИзменении(Элемент)
		Если Объект.НужнаКонвертация=Истина Тогда
		Элементы.КассаКонвертации.Видимость=Истина;
		Элементы.Курс.Видимость=Истина;
		Элементы.СуммаКонвертации.Видимость=Истина;
		Элементы.ВалютаКонвертации.Видимость=Истина;
	Иначе
		Элементы.КассаКонвертации.Видимость=Ложь;
		Элементы.Курс.Видимость=Ложь;
		Элементы.СуммаКонвертации.Видимость=Ложь;
		Элементы.ВалютаКонвертации.Видимость=Ложь;		
		КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура КурсПриИзменении(Элемент)
		Объект.СуммаКонвертации=Объект.СуммаОплаты/Объект.Курс;
КонецПроцедуры
